app/views/entrepreneurs/index.html.erb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."entrepreneur_id" = 2
---
        <td><%= entrepreneur.clientType %></td>
        <%@restaurant = Restaurant.find_all_by_entrepreneur_id(entrepreneur.id) %>