app/views/restaurators/_form.html.erb

<%@restaurants = Restaurant.all%>
---
SELECT "restaurants".* FROM "restaurants"