app/views/restaurators/index.html.erb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."restaurator_id" = 3
---
            <td><%= restaurator.clientType %></td>
            <td><%= @restaurant = Restaurant.find_all_by_restaurator_id(restaurator.id).count %></td>