app/views/restaurants/_form.html.erb

<%@restaurators = Restaurator.where(:clientType => Client::CLIENT_TYPES[:restaurator])%>
---
SELECT "clients".* FROM "clients" WHERE "clients"."clientType" = 'restaurator'