app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @client = Client.find(params[:id])

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @client = Client.find(params[:id])

SELECT "clients".* FROM "clients" WHERE "clients"."emailAddress" = 'vincent.dupuis.lemelin@gmail.com'
INSERT INTO "clients" ("address", "clientType", "created_at", "dateOfBirth", "emailAddress", "name", "password", "phoneNumber", "updated_at", "zipCode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #le client possédant les informations entrées par l'utilisateur (pas encore sauvegardé dans la BD)
    @client = Client.new(params[:client])
    @client.setAsVisitor
    #valide si l'adresse email donnée existe déjà dans la BD
    if(Client.find_all_by_emailAddress(@client.emailAddress).empty?)

      #valide si le password équivaut à la confirmation du password
      if @client.password.to_s() == @client.password_confirmation.to_s()

        #hashage du password
        @client.password = @client.encrypt_password

        respond_to do |format|
          #si la sauvegarde des informations dans la BD fonctionne
          if @client.save

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "clients" SET "password" = 'vincent', "updated_at" = '2014-06-18 19:06:51.242099' WHERE "clients"."id" = 3
---
  def update
    @client = Client.find(params[:id])
    temp_client = Client.new(params[:client])

    respond_to do |format|
      if temp_client.password.to_s == temp_client.password_confirmation.to_s
        temp_client.password = Digest::SHA1.hexdigest(temp_client.password)

        if @client.update_attributes(params[:client])

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 2]]
---
  def destroy
    @client = Client.find(params[:id])

    if (@client.id == current_user.id)
      session[:client_id] = nil
      session[:client_type] = nil

      @client.destroy