app/controllers/entrepreneurs_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "restaurants" SET "entrepreneur_id" = 18, "updated_at" = '2014-06-25 13:54:40.720316' WHERE "restaurants"."id" = 11
---
  def create
    @entrepreneur = Entrepreneur.new(params[:entrepreneur])
    @entrepreneur.setAsEntrepreneur

    #valide si l'adresse email donnée existe déjà dans la BD
    if(Entrepreneur.find_all_by_emailAddress(@entrepreneur.emailAddress).empty?)

      #valide si le password équivaut à la confirmation du password
      if @entrepreneur.password.to_s() == @entrepreneur.password_confirmation.to_s()

        #hashage du password
        @entrepreneur.password = @entrepreneur.encrypt_password

        respond_to do |format|
          if @entrepreneur.save

            if (@entrepreneur.linkedRestaurant != '')
              @restaurant = Restaurant.find(@entrepreneur.linkedRestaurant)

              if(@restaurant != nil)
                @restaurant.update_attribute(:entrepreneur_id, @entrepreneur.id)

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "restaurants" SET "entrepreneur_id" = 18, "updated_at" = '2014-06-25 14:16:44.790460' WHERE "restaurants"."id" = 11
---
  def update
    @entrepreneur = Entrepreneur.find(params[:id])
    temp_entrepreneur = Entrepreneur.new(params[:entrepreneur])

    if (temp_entrepreneur.linkedRestaurant != '')
      @restaurant = Restaurant.find(temp_entrepreneur.linkedRestaurant)

      if(@restaurant != nil)
        @restaurant.update_attribute(:entrepreneur_id, @entrepreneur.id)