app/controllers/restaurators_controller.rb

  def create
    @restaurator = Restaurator.new(params[:restaurator])
    @restaurator.setAsRestaurator

    #valide si l'adresse email donnée existe déjà dans la BD
    if(Restaurator.find_all_by_emailAddress(@restaurator.emailAddress).empty?)

      #valide si le password équivaut à la confirmation du password
      if @restaurator.password.to_s() == @restaurator.password_confirmation.to_s()

        #hashage du password
        @restaurator.password = @restaurator.encrypt_password

        respond_to do |format|
          if @restaurator.save

            if (@restaurator.linkedRestaurant != '')
              @restaurant = Restaurant.find(@restaurator.linkedRestaurant)

              if(@restaurant != nil)
                @restaurant.update_attribute(:restaurator_id, @restaurator.id)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "restaurants" SET "restaurator_id" = 3, "updated_at" = '2014-06-24 13:15:20.427856' WHERE "restaurants"."id" = 1

  def update
    @restaurator = Restaurator.find(params[:id])
    temp_restaurator = Restaurator.new(params[:restaurator])

    if (temp_restaurator.linkedRestaurant != '')
      @restaurant = Restaurant.find(temp_restaurator.linkedRestaurant)

      if(@restaurant != nil)
        @restaurant.update_attribute(:restaurator_id, @restaurator.id)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "restaurants" SET "restaurator_id" = 9, "updated_at" = '2014-06-25 14:14:51.109328' WHERE "restaurants"."id" = 11