app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(params[:restaurant])

    if (@restaurant.linkedRestaurator != '')
      @restaurant.restaurator_id = @restaurant.linkedRestaurator
    end

    if (@restaurant.linkedEntrepreneur != '')
      @restaurant.entrepreneur_id = @restaurant.linkedEntrepreneur
    end

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("address", "created_at", "entrepreneur_id", "name", "restaurator_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @restaurant = Restaurant.find(params[:id])
    temp_restaurant = Restaurant.new(params[:restaurant])

    if (temp_restaurant.linkedRestaurator != '')
      @restaurant.restaurator_id = temp_restaurant.linkedRestaurator
    end

    if (temp_restaurant.linkedEntrepreneur != '')
      @restaurant.entrepreneur_id = temp_restaurant.linkedEntrepreneur
    end

    respond_to do |format|
      if @restaurant.update_attributes(params[:restaurant])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "restaurants" SET "restaurator_id" = NULL, "entrepreneur_id" = NULL, "updated_at" = '2014-06-24 23:53:20.840140' WHERE "restaurants"."id" = 8